In [5]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\sklif\appdata\roaming\python\python313\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\sklif\appdata\roaming\python\python313\site-packages (from pandas) (2.4.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\sklif\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\sklif\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\sklif\appdata\roaming\python\python313\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\sklif\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [6]:
import numpy as np
import pandas as pd

In [7]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d  = {'a':10, 'b':20, 'c':30}

In [8]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data = my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(data=[sum, print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [13]:
ser1 = pd.Series(data=[1,2,3], index=['USA','GERMANY','JAPAN'])

In [14]:
ser1

USA        1
GERMANY    2
JAPAN      3
dtype: int64

In [15]:
ser2 = pd.Series(data=[1,2,5,4], index=['USA','GERMANY','ITALY','JAPAN'])

In [16]:
ser2

USA        1
GERMANY    2
ITALY      5
JAPAN      4
dtype: int64

In [17]:
ser1['USA']

np.int64(1)

In [18]:
ser1['JAPAN']

np.int64(3)

In [19]:
ser2['ITALY']

np.int64(5)

In [20]:
ser1+ser2

GERMANY    4.0
ITALY      NaN
JAPAN      7.0
USA        2.0
dtype: float64

## Pandas DataFrame Part1

In [21]:
import numpy as np
import pandas as pd

In [22]:
from numpy.random import randn

In [23]:
np.random.seed(101)

In [24]:
df  = pd.DataFrame(data =randn(5,4), index  =['A','B','C','D','E'], columns=['W','X','Y','Z'])

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [27]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [28]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [29]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [46]:
df.X #not good practice

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [31]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [32]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [33]:
df[['new']]

KeyError: "None of [Index(['new'], dtype='object')] are in the [columns]"

In [ ]:
df['new'] = df['W']+df['Y']

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.drop('new', axis =1) #Axis o means row and 1 means column #temporary delete column

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.drop('new', axis=1, inplace=True) #paramanatly delete

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df.shape #axis 0=Row-5 and axis 1=columns-4

(5, 4)

In [38]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df.loc['A'] # loc means location

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [40]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [41]:
df.iloc[3] #iloc means index location

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [42]:
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [43]:
df.loc['B','Y'] #single data colloction for we have to use like that

np.float64(-0.8480769834036315)

In [44]:
df.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [45]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

##  Pandas DataFrames -   part 02

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [50]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df['W']<0

A    False
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [52]:
df[df['W'] <0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [54]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [56]:
df[df['Z'] <0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [58]:
out=df[df['W'] >0]

In [59]:
out

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
out['W']

A    2.706850
B    0.651118
D    0.188695
E    0.190794
Name: W, dtype: float64

In [61]:
out[['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
D -0.758872  0.955057
E  1.978757  0.683509

In [62]:
out.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [63]:
out.loc[['A','D']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057

In [64]:
out.loc['C'] # C not here in database

KeyError: 'C'

In [65]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [67]:
df['W']>2

A     True
B    False
C    False
D    False
E    False
Name: W, dtype: bool

In [68]:
df[df['W']>2]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [70]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
(df['W']>2) & (df['Z']>0.5)

A     True
B    False
C    False
D    False
E    False
dtype: bool

In [71]:
df[(df['W']>2) & (df['Z']>0.5)]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [73]:
df[(df['W']>2) | (df['Z']>0.5)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df.reset_index() #if we wanna reset our dataset then we used reset and it's parmanenet reset

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [76]:
newind = 'CA NY WY OR CD'.split() #same lenth hote hobe must be

In [77]:
newind

['CA', 'NY', 'WY', 'OR', 'CD']

In [78]:
df['states']  = newind

In [79]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CD

In [80]:
df.set_index('states')  #  fro mparamanenet, use inplace

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CD      0.190794  1.978757  2.605967  0.683509

In [83]:
df.set_index('states', inplace=True)

In [82]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CD

In [84]:
df.reset_index( inplace=True)

In [85]:
df

  states         W         X         Y         Z
0     CA  2.706850  0.628133  0.907969  0.503826
1     NY  0.651118 -0.319318 -0.848077  0.605965
2     WY -2.018168  0.740122  0.528813 -0.589001
3     OR  0.188695 -0.758872 -0.933237  0.955057
4     CD  0.190794  1.978757  2.605967  0.683509

Panda'S DataFrame Part -3

In [86]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [87]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [88]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [89]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [92]:
df = pd.DataFrame(data = randn(6,2),index=hier_index,  columns=['A','B'])

In [93]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [97]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [98]:
df.loc['G2']

          A         B
1  0.166905  0.184502
2  0.807706  0.072960
3  0.638787  0.329646

In [101]:
df.loc['G1'].loc[2] #if u wanna pikup row then we have to use another

A   -1.706086
B   -1.159119
Name: 2, dtype: float64

In [102]:
df.loc['G1']['B'] #Grap the column

1    1.693723
2   -1.159119
3    0.390528
Name: B, dtype: float64

In [103]:
df.loc['G1'].loc[2]['B']

np.float64(-1.1591194155484297)

In [104]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [105]:
df.xs('G1')

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [106]:
df.index.names

FrozenList([None, None])

In [107]:
df.index.names = ['Group', 'Num']

In [108]:
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

In [109]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [111]:
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

In [110]:
df.xs(1, level = 'Num')

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

In [112]:
df.xs(3, level = 'Num')

              A         B
Group
G1    -0.134841  0.390528
G2     0.638787  0.329646

In [113]:
df.xs('G1', level = 'Group')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

Missing data

In [114]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan, np.nan], 'C':[1,2,3]}

In [115]:
df = pd.DataFrame(d)

In [116]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [117]:
df + df

     A     B  C
0  2.0  10.0  2
1  4.0   NaN  4
2  NaN   NaN  6

In [118]:
df.dropna() #if we wanna nun value of all

     A    B  C
0  1.0  5.0  1

In [119]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [120]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [122]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [121]:
df.dropna(axis=0 , thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [123]:
df.dropna(axis=0 , thresh=3)

     A    B  C
0  1.0  5.0  1

In [124]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [125]:
df.fillna(value='fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  fill Value  2
2  fill Value  fill Value  3

In [126]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [131]:
df['A'].mean(numeric_only=True)

np.float64(1.5)

In [128]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

#groupBy

In [132]:
data = {'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'], 'person':['Sam','Charlie','Amy', 'Vanessa','Carl','Sarah'],'Sales':[200,120,340,124,243,350]}

In [133]:
df = pd.DataFrame(data)

In [134]:
df

  Company   person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [136]:
byComp = df.groupby('Company')

In [139]:
byComp.mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [140]:
byComp.sum(numeric_only=True)

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [141]:
byComp.mean(numeric_only=True).loc['FB']

Sales    296.5
Name: FB, dtype: float64

In [142]:
df.groupby('Company').count()

         person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [143]:
df

  Company   person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [144]:
df.groupby('Company').max()

          person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [145]:
df.groupby('Company').min()

          person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [146]:
df.groupby('Company').describe() #full overview  if we wanna know , this groupby much more important for exam

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [147]:
df.groupby('Company').describe().loc['MSFT']

Sales  count      2.000000
       mean     232.000000
       std      152.735065
       min      124.000000
       25%      178.000000
       50%      232.000000
       75%      286.000000
       max      340.000000
Name: MSFT, dtype: float64

In [148]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000